INSERT INTO authors (last_name, first_name, middle_name)
VALUES
('Пушкин', 'Александр', 'Сергеевич'),
('Гоголь', 'Николай', 'Васильевич'),
('Конан Дойл', 'Артур', 'Игнейшус'),
('Кристи', 'Агата', null),
('Шолохов', 'Михаил', 'Александрович'),
('Ньюи', 'Эндриан', null);

INSERT INTO readers (last_name, first_name, middle_name, address, passport_sn)
VALUES
('Ефремов', 'Виктор', 'Иринеевич', 'ул. Победы', '7816_789456'),
('Ширяев', 'Илья', 'Евгеньевич', 'ул. Инженерная', '7815_159456'),
('Шувалов', 'Трофим', 'Тимофеевич', 'ул. Алябьева', '7614_123459'),
('Комиссаров', 'Емельян', 'Витальевич', 'ул. Пушкина', '7610_123147'),
('Капустин', 'Орест', 'Эдуардович', 'ул. Труда', '7821_357924'),
('Исаев', 'Игнатий', 'Арсеньевич', 'ул. Айвазовского', '7823_213251');

INSERT INTO books_editions (isbn, title, author, published_year, language_book, count_books)
VALUES
('978-7-00054-181-6', 'Дубровский', 1, 1832, 'ru', 3),
('978-7-00054-182-6', 'Капитанская дочка', 1, 1857, 'ru', 10),
('978-7-00054-183-6', 'Вий', 2, 1835, 'ru', 2),
('978-7-00054-184-6', 'Вечера на хуторе близ Диканьки', 2, 1830, 'ru', 5),
('978-7-00054-185-6', 'Барышня-крестьянка', 1, 1832, 'ru', 2);

INSERT INTO issued_books (edition, reader, issue_date)
VALUES
(1, 4, '2023-05-03'),
(3, 2, '2023-05-04'),
(1, 1, '2023-05-06'),
(2, 1, '2023-05-06'),
(3, 6, '2023-05-05'),
(4, 6, '2023-05-05'),
(1, 2, '2023-05-08');

